import React, { Component } from 'react';
import ReactDom from 'react-dom';
import { Tree } from 'antd';

import jsonTest from './data/data.json'
import jsonTree from './data/tree.json'

import 'antd/dist/antd.css'
import './css/basic.css'

const TreeNode = Tree.TreeNode;


const treeData = [
    {
        "title": "模块",
        "key": "0-0",
        "children": [
            {
                "title": "框架/架构设计",
                "key": "0-0-0",
                "children": [
                    {
                        "title": "配置管理设计",
                        "key": "0-0-0-0",
                        "children": [
                            {
                                "title": "≤5 (参考范围)",
                                "key": "0-0-0-0-0",
                            },
                            {
                                "title": "个 (单位)",
                                "key": "0-0-0-0-1",
                            },
                            {
                                "title": "1 (综合后 人/天)",
                                "key": "0-0-0-0-2",
                            },
                            {
                                "title": "1 (数量 人/天)",
                                "key": "0-0-0-0-3"
                            },
                            {
                                "title": "2 (Flash)",
                                "key": "0-0-0-0-4"
                            },
                            {
                                "title": "2 (Unity 3D)",
                                "key": "0-0-0-0-5"
                            },
                            {
                                "title": "3 (C# WPF/WF)",
                                "key": "0-0-0-0-6"
                            },
                            {
                                "title": "1 (软件开发 人/天)",
                                "key": "0-0-0-0-7"
                            },
                            {
                                "title": "2.33 (result)",
                                "key": "0-0-0-0-8"
                            },
                            {
                                "title": "1.67 (两者平均)",
                                "key": "0-0-0-0-9"
                            }
                        ]
                    },
                    {
                        "title": "数据设计",
                        "key": "0-0-0-1",
                        "children": [
                            {
                                "title": "≤5 (参考范围)",
                                "key": "0-0-0-1-0"
                            },
                            {
                                "title": "个 (单位)",
                                "key": "0-0-0-1-1"
                            },
                            {
                                "title": "4 (综合后 人/天)",
                                "key": "0-0-0-1-2"
                            },
                            {
                                "title": "3 (数量 人/天)",
                                "key": "0-0-0-1-3"
                            },
                            {
                                "title": "3 (Flash)",
                                "key": "0-0-0-1-4"
                            },
                            {
                                "title": "5 (Unity 3D)",
                                "key": "0-0-0-1-5"
                            },
                            {
                                "title": "4 (C# WPF/WF)",
                                "key": "0-0-0-1-6"
                            },
                            {
                                "title": "3 (软件开发 人/天)",
                                "key": "0-0-0-1-7"
                            },
                            {
                                "title": "4 (result)",
                                "key": "0-0-0-1-8"
                            },
                            {
                                "title": "3.5 (两者平均)",
                                "key": "0-0-0-1-9"
                            }
                        ]
                    },
                    {
                        "title": "接口设计",
                        "key": "0-0-0-2",
                        "children": [
                            {
                                "title": "≤10 (参考范围)",
                                "key": "0-0-0-2-0"
                            },
                            {
                                "title": "个 (单位)",
                                "key": "0-0-0-2-1"
                            },
                            {
                                "title": "4 (综合后 人/天)",
                                "key": "0-0-0-2-2"
                            },
                            {
                                "title": "4 (数量 人/天)",
                                "key": "0-0-0-2-3"
                            },
                            {
                                "title": "4 (Flash)",
                                "key": "0-0-0-2-4"
                            },
                            {
                                "title": "4 (Unity 3D)",
                                "key": "0-0-0-2-5"
                            },
                            {
                                "title": "4 (C# WPF/WF)",
                                "key": "0-0-0-2-6"
                            },
                            {
                                "title": "4 (软件开发 人/天)",
                                "key": "0-0-0-2-7"
                            },
                            {
                                "title": "4 (result)",
                                "key": "0-0-0-2-8"
                            },
                            {
                                "title": "4 (两者平均)",
                                "key": "0-0-0-2-9"
                            }
                        ]
                    },
                    {
                        "title": "模块设计",
                        "key": "0-0-0-3",
                        "children": [
                            {
                                "title": "5 (参考范围)",
                                "key": "0-0-0-3-0"
                            },
                            {
                                "title": "个 (单位)",
                                "key": "0-0-0-3-1"
                            },
                            {
                                "title": "4 (综合后 人/天)",
                                "key": "0-0-0-3-2"
                            },
                            {
                                "title": "3 (数量 人/天)",
                                "key": "0-0-0-3-3"
                            },
                            {
                                "title": "4 (Flash)",
                                "key": "0-0-0-3-4"
                            },
                            {
                                "title": "4 (Unity 3D)",
                                "key": "0-0-0-3-5"
                            },
                            {
                                "title": "4 (C# WPF/WF)",
                                "key": "0-0-0-3-6"
                            },
                            {
                                "title": "3 (软件开发 人/天)",
                                "key": "0-0-0-3-7"
                            },
                            {
                                "title": "4 (result)",
                                "key": "0-0-0-3-8"
                            },
                            {
                                "title": "4 (两者平均)",
                                "key": "0-0-0-3-9"
                            }
                        ]
                    },
                    {
                        "title": "框架搭建",
                        "key": "0-0-0-4",
                        "children": [
                            {
                                "title": "1 (参考范围)",
                                "key": "0-0-0-4-0"
                            },
                            {
                                "title": "项 (单位)",
                                "key": "0-0-0-4-1"
                            },
                            {
                                "title": "5 (综合后 人/天)",
                                "key": "0-0-0-4-2"
                            },
                            {
                                "title": "4 (数量 人/天)",
                                "key": "0-0-0-4-3"
                            },
                            {
                                "title": "3 (Flash)",
                                "key": "0-0-0-4-4"
                            },
                            {
                                "title": "5 (Unity 3D)",
                                "key": "0-0-0-4-5"
                            },
                            {
                                "title": "10 (C# WPF/WF)",
                                "key": "0-0-0-4-6"
                            },
                            {
                                "title": "3 (软件开发 人/天)",
                                "key": "0-0-0-4-7"
                            },
                            {
                                "title": "6 (result)",
                                "key": "0-0-0-4-8"
                            },
                            {
                                "title": "4.5 (两者平均)",
                                "key": "0-0-0-4-9"
                            }
                        ]
                    }
                ]
            },
            {
                "title": "视图/显示模块",
                "key": "0-0-1",
                "children": [
                    {
                        "title": "2D场景",
                        "key": "0-0-1-0",
                        "children": [
                            {
                                "title": "页面布局",
                                "key": "0-0-1-0-0",
                                "children": [
                                    {
                                        "title": "1 (参考范围)",
                                        "key": "0-0-1-0-0-0"
                                    },
                                    {
                                        "title": "页 (单位)",
                                        "key": "0-0-1-0-0-1"
                                    },
                                    {
                                        "title": "5 (综合后 人/天)",
                                        "key": "0-0-1-0-0-2"
                                    },
                                    {
                                        "title": "3 (数量 人/天)",
                                        "key": "0-0-1-0-0-3"
                                    },
                                    {
                                        "title": "3 (Flash)",
                                        "key": "0-0-1-0-0-4"
                                    },
                                    {
                                        "title": "5 (Unity 3D)",
                                        "key": "0-0-1-0-0-5"
                                    },
                                    {
                                        "title": "10 (C# WPF/WF)",
                                        "key": "0-0-1-0-0-6"
                                    },
                                    {
                                        "title": "3 (软件开发 人/天)",
                                        "key": "0-0-1-0-0-7"
                                    },
                                    {
                                        "title": "6 (result)",
                                        "key": "0-0-1-0-0-8"
                                    },
                                    {
                                        "title": "4.5 (两者平均)",
                                        "key": "0-0-1-0-0-9"
                                    }
                                ]
                            },
                            {
                                "title": "UI组件",
                                "key": "0-0-1-0-1",
                                "children": [
                                    {
                                        "title": "1 (参考范围)",
                                        "key": "0-0-1-0-1-0"
                                    },
                                    {
                                        "title": "个 (单位)",
                                        "key": "0-0-1-0-1-1"
                                    },
                                    {
                                        "title": "5 (综合后 人/天)",
                                        "key": "0-0-1-0-1-2"
                                    },
                                    {
                                        "title": "5 (数量 人/天)",
                                        "key": "0-0-1-0-1-3"
                                    },
                                    {
                                        "title": "5 (Flash)",
                                        "key": "0-0-1-0-1-4"
                                    },
                                    {
                                        "title": "5 (Unity 3D)",
                                        "key": "0-0-1-0-1-5"
                                    },
                                    {
                                        "title": "7 (C# WPF/WF)",
                                        "key": "0-0-1-0-1-6"
                                    },
                                    {
                                        "title": "5 (软件开发 人/天)",
                                        "key": "0-0-1-0-1-7"
                                    },
                                    {
                                        "title": "5.67 (result)",
                                        "key": "0-0-1-0-1-8"
                                    },
                                    {
                                        "title": "5.33 (两者平均)",
                                        "key": "0-0-1-0-1-9"
                                    }
                                ]
                            },
                            {
                                "title": "第三方UI组件",
                                "key": "0-0-1-0-2",
                                "children": [
                                    {
                                        "title": "1 (参考范围)",
                                        "key": "0-0-1-0-2-0"
                                    },
                                    {
                                        "title": "个 (单位)",
                                        "key": "0-0-1-0-2-1"
                                    },
                                    {
                                        "title": "2 (综合后 人/天)",
                                        "key": "0-0-1-0-2-2"
                                    },
                                    {
                                        "title": "2 (数量 人/天)",
                                        "key": "0-0-1-0-2-3"
                                    },
                                    {
                                        "title": "3 (Flash)",
                                        "key": "0-0-1-0-2-4"
                                    },
                                    {
                                        "title": "0 (Unity 3D)",
                                        "key": "0-0-1-0-2-5"
                                    },
                                    {
                                        "title": "5 (C# WPF/WF)",
                                        "key": "0-0-1-0-2-6"
                                    },
                                    {
                                        "title": "10 (软件开发 人/天)",
                                        "key": "0-0-1-0-2-7"
                                    },
                                    {
                                        "title": "2.67 (result)",
                                        "key": "0-0-1-0-2-8"
                                    },
                                    {
                                        "title": "2.33 (两者平均)",
                                        "key": "0-0-1-0-2-9"
                                    }
                                ]
                            },
                            {
                                "title": "动态特效",
                                "key": "0-0-1-0-3",
                                "children": [
                                    {
                                        "title": "1 (参考范围)",
                                        "key": "0-0-1-0-3-0"
                                    },
                                    {
                                        "title": "个 (单位)",
                                        "key": "0-0-1-0-3-1"
                                    },
                                    {
                                        "title": "10 (综合后 人/天)",
                                        "key": "0-0-1-0-3-2"
                                    },
                                    {
                                        "title": "10 (数量 人/天)",
                                        "key": "0-0-1-0-3-3"
                                    },
                                    {
                                        "title": "10 (Flash)",
                                        "key": "0-0-1-0-3-4"
                                    },
                                    {
                                        "title": "15 (Unity 3D)",
                                        "key": "0-0-1-0-3-5"
                                    },
                                    {
                                        "title": "0 (C# WPF/WF)",
                                        "key": "0-0-1-0-3-6"
                                    },
                                    {
                                        "title": "10 (软件开发 人/天)",
                                        "key": "0-0-1-0-3-7"
                                    },
                                    {
                                        "title": "8.33 (result)",
                                        "key": "0-0-1-0-3-8"
                                    },
                                    {
                                        "title": "9.17 (两者平均)",
                                        "key": "0-0-1-0-3-9"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "title": "3D场景",
                        "key": "0-0-1-1",
                        "children": [
                            {
                                "title": "场景环境",
                                "key": "0-0-1-1-0",
                                "children": [
                                    {
                                        "title": "1 (参考范围)",
                                        "key": "0-0-1-1-0-0"
                                    },
                                    {
                                        "title": "个 (单位)",
                                        "key": "0-0-1-1-0-1"
                                    },
                                    {
                                        "title": "25 (综合后 人/天)",
                                        "key": "0-0-1-1-0-2"
                                    },
                                    {
                                        "title": "25 (数量 人/天)",
                                        "key": "0-0-1-1-0-3"
                                    },
                                    {
                                        "title": "0 (Flash)",
                                        "key": "0-0-1-1-0-4"
                                    },
                                    {
                                        "title": "25 (Unity 3D)",
                                        "key": "0-0-1-1-0-5"
                                    },
                                    {
                                        "title": "0 (C# WPF/WF)",
                                        "key": "0-0-1-1-0-6"
                                    },
                                    {
                                        "title": "25 (软件开发 人/天)",
                                        "key": "0-0-1-1-0-7"
                                    },
                                    {
                                        "title": "8.33 (result)",
                                        "key": "0-0-1-1-0-8"
                                    },
                                    {
                                        "title": "  (两者平均)",
                                        "key": "0-0-1-1-0-9"
                                    }
                                ]
                            },
                            {
                                "title": "动态特效",
                                "key": "0-0-1-1-1",
                                "children": [
                                    {
                                        "title": "1 (参考范围)",
                                        "key": "0-0-1-1-1-0"
                                    },
                                    {
                                        "title": "个 (单位)",
                                        "key": "0-0-1-1-1-1"
                                    },
                                    {
                                        "title": "20 (综合后 人/天)",
                                        "key": "0-0-1-1-1-2"
                                    },
                                    {
                                        "title": "20 (数量 人/天)",
                                        "key": "0-0-1-1-1-3"
                                    },
                                    {
                                        "title": "0 (Flash)",
                                        "key": "0-0-1-1-1-4"
                                    },
                                    {
                                        "title": "20 (Unity 3D)",
                                        "key": "0-0-1-1-1-5"
                                    },
                                    {
                                        "title": "0 (C# WPF/WF)",
                                        "key": "0-0-1-1-1-6"
                                    },
                                    {
                                        "title": "20 (软件开发 人/天)",
                                        "key": "0-0-1-1-1-7"
                                    },
                                    {
                                        "title": "6.67 (result)",
                                        "key": "0-0-1-1-1-8"
                                    },
                                    {
                                        "title": "  (两者平均)",
                                        "key": "0-0-1-1-0-9"
                                    }
                                ]
                            },
                            {
                                "title": "3D组件",
                                "key": "0-0-1-1-2",
                                "children": [
                                    {
                                        "title": "1 (参考范围)",
                                        "key": "0-0-1-1-2-0"
                                    },
                                    {
                                        "title": "个 (单位)",
                                        "key": "0-0-1-1-2-1"
                                    },
                                    {
                                        "title": "10 (综合后 人/天)",
                                        "key": "0-0-1-1-2-2"
                                    },
                                    {
                                        "title": "10 (数量 人/天)",
                                        "key": "0-0-1-1-2-3"
                                    },
                                    {
                                        "title": "0 (Flash)",
                                        "key": "0-0-1-1-2-4"
                                    },
                                    {
                                        "title": "10 (Unity 3D)",
                                        "key": "0-0-1-1-2-5"
                                    },
                                    {
                                        "title": "0 (C# WPF/WF)",
                                        "key": "0-0-1-1-2-6"
                                    },
                                    {
                                        "title": "10 (软件开发 人/天)",
                                        "key": "0-0-1-1-2-7"
                                    },
                                    {
                                        "title": "3.33 (result)",
                                        "key": "0-0-1-1-2-8"
                                    },
                                    {
                                        "title": "  (两者平均)",
                                        "key": "0-0-1-1-2-9"
                                    }
                                ]
                            },
                            {
                                "title": "第三方3D组件",
                                "key": "0-0-0-1-1-3",
                                "children": [
                                    {
                                        "title": "1 (参考范围)",
                                        "key": "0-0-1-1-3-0"
                                    },
                                    {
                                        "title": "个 (单位)",
                                        "key": "0-0-1-1-3-1"
                                    },
                                    {
                                        "title": "5 (综合后 人/天)",
                                        "key": "0-0-1-1-3-2"
                                    },
                                    {
                                        "title": "4 (数量 人/天)",
                                        "key": "0-0-1-1-3-3"
                                    },
                                    {
                                        "title": "0 (Flash)",
                                        "key": "0-0-1-1-3-4"
                                    },
                                    {
                                        "title": "5 (Unity 3D)",
                                        "key": "0-0-1-1-3-5"
                                    },
                                    {
                                        "title": "0 (C# WPF/WF)",
                                        "key": "0-0-1-1-3-6"
                                    },
                                    {
                                        "title": "5 (软件开发 人/天)",
                                        "key": "0-0-1-1-3-7"
                                    },
                                    {
                                        "title": "1.67 (result)",
                                        "key": "0-0-1-1-3-8"
                                    },
                                    {
                                        "title": "  (两者平均)",
                                        "key": "0-0-1-1-3-9"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "title": "交互/控制模块",
                "key": "0-0-2",
                "children": [
                    {
                        "title": "硬件交互控制",
                        "key": "0-0-2-0",
                        "children": [
                            {
                                "title": "PC标准输入/输出设备",
                                "key": "0-0-2-0-0",
                                "children": [
                                    {
                                        "title": "≤5 (参考范围)",
                                        "key": "0-0-2-0-0-0"
                                    },
                                    {
                                        "title": "交互点 (单位)",
                                        "key": "0-0-2-0-0-1"
                                    },
                                    {
                                        "title": "5 (综合后 人/天)",
                                        "key": "0-0-2-0-0-2"
                                    },
                                    {
                                        "title": "5 (数量 人/天)",
                                        "key": "0-0-2-0-0-3"
                                    },
                                    {
                                        "title": "5 (Flash)",
                                        "key": "0-0-2-0-0-4"
                                    },
                                    {
                                        "title": "5 (Unity 3D)",
                                        "key": "0-0-2-0-0-5"
                                    },
                                    {
                                        "title": "5 (C# WPF/WF)",
                                        "key": "0-0-2-0-0-6"
                                    },
                                    {
                                        "title": "5 (软件开发 人/天)",
                                        "key": "0-0-2-0-0-7"
                                    },
                                    {
                                        "title": "5.00 (result)",
                                        "key": "0-0-2-0-0-8"
                                    },
                                    {
                                        "title": "5  (两者平均)",
                                        "key": "0-0-2-0-0-9"
                                    }
                                ]
                            },
                            {
                                "title": "PC非标准输入/输出设备",
                                "key": "0-0-2-0-1",
                                "children": [
                                    {
                                        "title": "≤5 (参考范围)",
                                        "key": "0-0-2-0-1-0"
                                    },
                                    {
                                        "title": "交互点 (单位)",
                                        "key": "0-0-2-0-1-1"
                                    },
                                    {
                                        "title": "10 (综合后 人/天)",
                                        "key": "0-0-2-0-1-2"
                                    },
                                    {
                                        "title": "10 (数量 人/天)",
                                        "key": "0-0-2-0-1-3"
                                    },
                                    {
                                        "title": "10 (Flash)",
                                        "key": "0-0-2-0-1-4"
                                    },
                                    {
                                        "title": "10 (Unity 3D)",
                                        "key": "0-0-2-0-1-5"
                                    },
                                    {
                                        "title": "10 (C# WPF/WF)",
                                        "key": "0-0-2-0-0-6"
                                    },
                                    {
                                        "title": " (软件开发 人/天)",
                                        "key": "0-0-2-0-0-7"
                                    },
                                    {
                                        "title": "10.00 (result)",
                                        "key": "0-0-2-0-0-8"
                                    },
                                    {
                                        "title": "5  (两者平均)",
                                        "key": "0-0-2-0-0-9"
                                    }
                                ]
                            },
                            {
                                "title": "商用产品设备",
                                "key": "0-0-2-0-2",
                                "children": [
                                    {
                                        "title": "≤5 (参考范围)",
                                        "key": "0-0-2-0-2-0"
                                    },
                                    {
                                        "title": "交互点 (单位)",
                                        "key": "0-0-2-0-2-1"
                                    },
                                    {
                                        "title": "20 (综合后 人/天)",
                                        "key": "0-0-2-0-2-2"
                                    },
                                    {
                                        "title": "20 (数量 人/天)",
                                        "key": "0-0-2-0-2-3"
                                    },
                                    {
                                        "title": "20 (Flash)",
                                        "key": "0-0-2-0-2-4"
                                    },
                                    {
                                        "title": "20 (Unity 3D)",
                                        "key": "0-0-2-0-2-5"
                                    },
                                    {
                                        "title": "20 (C# WPF/WF)",
                                        "key": "0-0-2-0-2-6"
                                    },
                                    {
                                        "title": " (软件开发 人/天)",
                                        "key": "0-0-2-0-2-7"
                                    },
                                    {
                                        "title": "20 (result)",
                                        "key": "0-0-2-0-2-8"
                                    },
                                    {
                                        "title": "10  (两者平均)",
                                        "key": "0-0-2-0-2-9"
                                    }
                                ]
                            },
                            {
                                "title": "商用配件产品",
                                "key": "0-0-2-0-3",
                                "children": [
                                    {
                                        "title": "≤5 (参考范围)",
                                        "key": "0-0-2-0-3-0"
                                    },
                                    {
                                        "title": "交互点 (单位)",
                                        "key": "0-0-2-0-3-1"
                                    },
                                    {
                                        "title": "15 (综合后 人/天)",
                                        "key": "0-0-2-0-3-2"
                                    },
                                    {
                                        "title": "15 (数量 人/天)",
                                        "key": "0-0-2-0-3-3"
                                    },
                                    {
                                        "title": "15 (Flash)",
                                        "key": "0-0-2-0-3-4"
                                    },
                                    {
                                        "title": "15 (Unity 3D)",
                                        "key": "0-0-2-0-3-5"
                                    },
                                    {
                                        "title": "15 (C# WPF/WF)",
                                        "key": "0-0-2-0-3-6"
                                    },
                                    {
                                        "title": " (软件开发 人/天)",
                                        "key": "0-0-2-0-3-7"
                                    },
                                    {
                                        "title": "15 (result)",
                                        "key": "0-0-2-0-3-8"
                                    },
                                    {
                                        "title": "7.5  (两者平均)",
                                        "key": "0-0-2-0-3-9"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "title": "软件交互控制",
                        "key": "0-0-2-1",
                        "children": [
                            {
                                "title": "通信模块",
                                "key": "0-0-2-1-0",
                                "children": [
                                    {
                                        "title": "1 (参考范围)",
                                        "key": "0-0-2-1-0-0"
                                    },
                                    {
                                        "title": "项 (单位)",
                                        "key": "0-0-2-1-0-1"
                                    },
                                    {
                                        "title": "6 (综合后 人/天)",
                                        "key": "0-0-2-1-0-2"
                                    },
                                    {
                                        "title": "5 (数量 人/天)",
                                        "key": "0-0-2-1-0-3"
                                    },
                                    {
                                        "title": "5 (Flash)",
                                        "key": "0-0-2-1-0-4"
                                    },
                                    {
                                        "title": "10 (Unity 3D)",
                                        "key": "0-0-2-1-0-5"
                                    },
                                    {
                                        "title": "7 (C# WPF/WF)",
                                        "key": "0-0-2-1-0-6"
                                    },
                                    {
                                        "title": "5  (软件开发 人/天)",
                                        "key": "0-0-2-1-0-7"
                                    },
                                    {
                                        "title": "7.33 (result)",
                                        "key": "0-0-2-1-0-8"
                                    },
                                    {
                                        "title": "6.17  (两者平均)",
                                        "key": "0-0-2-1-0-9"
                                    }
                                ]
                            },
                            {
                                "title": "视频控制",
                                "key": "0-0-2-1-1",
                                "children": [
                                    {
                                        "title": "≤5 (参考范围)",
                                        "key": "0-0-2-1-1-0"
                                    },
                                    {
                                        "title": "交互点 (单位)",
                                        "key": "0-0-2-1-1-1"
                                    },
                                    {
                                        "title": "2 (综合后 人/天)",
                                        "key": "0-0-2-1-1-2"
                                    },
                                    {
                                        "title": "2 (数量 人/天)",
                                        "key": "0-0-2-1-1-3"
                                    },
                                    {
                                        "title": "2 (Flash)",
                                        "key": "0-0-2-1-1-4"
                                    },
                                    {
                                        "title": "2 (Unity 3D)",
                                        "key": "0-0-2-1-1-5"
                                    },
                                    {
                                        "title": "4 (C# WPF/WF)",
                                        "key": "0-0-2-1-1-6"
                                    },
                                    {
                                        "title": "2  (软件开发 人/天)",
                                        "key": "0-0-2-1-1-7"
                                    },
                                    {
                                        "title": "2.67 (result)",
                                        "key": "0-0-2-1-1-8"
                                    },
                                    {
                                        "title": "2.33  (两者平均)",
                                        "key": "0-0-2-1-1-9"
                                    }
                                ]
                            },
                            {
                                "title": "同屏、多屏联动",
                                "key": "0-0-2-1-2",
                                "children": [
                                    {
                                        "title": "≤2 (参考范围)",
                                        "key": "0-0-2-1-2-0"
                                    },
                                    {
                                        "title": "屏 (单位)",
                                        "key": "0-0-2-1-2-1"
                                    },
                                    {
                                        "title": "3 (综合后 人/天)",
                                        "key": "0-0-2-1-2-2"
                                    },
                                    {
                                        "title": "2 (数量 人/天)",
                                        "key": "0-0-2-1-2-3"
                                    },
                                    {
                                        "title": "3 (Flash)",
                                        "key": "0-0-2-1-2-4"
                                    },
                                    {
                                        "title": "2 (Unity 3D)",
                                        "key": "0-0-2-1-2-5"
                                    },
                                    {
                                        "title": "5 (C# WPF/WF)",
                                        "key": "0-0-2-1-2-6"
                                    },
                                    {
                                        "title": "2  (软件开发 人/天)",
                                        "key": "0-0-2-1-2-7"
                                    },
                                    {
                                        "title": "3.33 (result)",
                                        "key": "0-0-2-1-2-8"
                                    },
                                    {
                                        "title": "2.67  (两者平均)",
                                        "key": "0-0-2-1-2-9"
                                    }
                                ]
                            },
                            {
                                "title": "页面交互控制",
                                "key": "0-0-2-1-3",
                                "children": [
                                    {
                                        "title": "≤10 (参考范围)",
                                        "key": "0-0-2-1-3-0"
                                    },
                                    {
                                        "title": "交互点 (单位)",
                                        "key": "0-0-2-1-3-1"
                                    },
                                    {
                                        "title": "3 (综合后 人/天)",
                                        "key": "0-0-2-1-3-2"
                                    },
                                    {
                                        "title": "3 (数量 人/天)",
                                        "key": "0-0-2-1-3-3"
                                    },
                                    {
                                        "title": "3 (Flash)",
                                        "key": "0-0-2-1-3-4"
                                    },
                                    {
                                        "title": "3 (Unity 3D)",
                                        "key": "0-0-2-1-3-5"
                                    },
                                    {
                                        "title": "5 (C# WPF/WF)",
                                        "key": "0-0-2-1-3-6"
                                    },
                                    {
                                        "title": "3  (软件开发 人/天)",
                                        "key": "0-0-2-1-3-7"
                                    },
                                    {
                                        "title": "3.67 (result)",
                                        "key": "0-0-2-1-3-8"
                                    },
                                    {
                                        "title": "3.33  (两者平均)",
                                        "key": "0-0-2-1-3-9"
                                    }
                                ]
                            },
                        ]
                    }
                ]
            },
            {
                "title": "模型/数据模块",
                "key": "0-0-3",
                "children": [
                    {
                        "title": "业务逻辑",
                        "key": "0-0-3-0",
                        "children": [
                            {
                                "title": "1 (参考范围)",
                                "key": "0-0-3-0-0"
                            },
                            {
                                "title": "项 (单位)",
                                "key": "0-0-3-0-1"
                            },
                            {
                                "title": "6 (综合后 人/天)",
                                "key": "0-0-3-0-2"
                            },
                            {
                                "title": "5 (数量 人/天)",
                                "key": "0-0-3-0-3"
                            },
                            {
                                "title": "7 (Flash)",
                                "key": "0-0-3-0-4"
                            },
                            {
                                "title": "10 (Unity 3D)",
                                "key": "0-0-3-0-5"
                            },
                            {
                                "title": "7 (C# WPF/WF)",
                                "key": "0-0-3-0-6"
                            },
                            {
                                "title": "5  (软件开发 人/天)",
                                "key": "0-0-3-0-7"
                            },
                            {
                                "title": "8.00 (result)",
                                "key": "0-0-3-0-8"
                            },
                            {
                                "title": "6.50  (两者平均)",
                                "key": "0-0-3-0-9"
                            }
                        ]
                    },
                    {
                        "title": "数据存储",
                        "key": "0-0-3-1",
                        "children": [
                            {
                                "title": "≤5 (参考范围)",
                                "key": "0-0-3-0-0"
                            },
                            {
                                "title": "个 (单位)",
                                "key": "0-0-3-0-1"
                            },
                            {
                                "title": "4 (综合后 人/天)",
                                "key": "0-0-3-0-2"
                            },
                            {
                                "title": "3 (数量 人/天)",
                                "key": "0-0-3-0-3"
                            },
                            {
                                "title": "5 (Flash)",
                                "key": "0-0-3-0-4"
                            },
                            {
                                "title": "3 (Unity 3D)",
                                "key": "0-0-3-0-5"
                            },
                            {
                                "title": "5 (C# WPF/WF)",
                                "key": "0-0-3-0-6"
                            },
                            {
                                "title": "3  (软件开发 人/天)",
                                "key": "0-0-3-0-7"
                            },
                            {
                                "title": "4.33 (result)",
                                "key": "0-0-3-0-8"
                            },
                            {
                                "title": "3.67  (两者平均)",
                                "key": "0-0-3-0-9"
                            }
                        ]
                    },
                    {
                        "title": "数据分析处理",
                        "key": "0-0-3-2",
                        "children": [
                            {
                                "title": "1 (参考范围)",
                                "key": "0-0-3-2-0"
                            },
                            {
                                "title": "项 (单位)",
                                "key": "0-0-3-2-1"
                            },
                            {
                                "title": "25 (综合后 人/天)",
                                "key": "0-0-3-2-2"
                            },
                            {
                                "title": "25 (数量 人/天)",
                                "key": "0-0-3-2-3"
                            },
                            {
                                "title": "25 (Flash)",
                                "key": "0-0-3-2-4"
                            },
                            {
                                "title": "20 (Unity 3D)",
                                "key": "0-0-3-2-5"
                            },
                            {
                                "title": "25 (C# WPF/WF)",
                                "key": "0-0-3-2-6"
                            },
                            {
                                "title": "25  (软件开发 人/天)",
                                "key": "0-0-3-2-7"
                            },
                            {
                                "title": "23.33 (result)",
                                "key": "0-0-3-2-8"
                            },
                            {
                                "title": "24.17  (两者平均)",
                                "key": "0-0-3-2-9"
                            }
                        ]
                    },
                    {
                        "title": "第三方API",
                        "key": "0-0-3-3",
                        "children": [
                            {
                                "title": "1 (参考范围)",
                                "key": "0-0-3-3-0"
                            },
                            {
                                "title": "个 (单位)",
                                "key": "0-0-3-3-1"
                            },
                            {
                                "title": "6 (综合后 人/天)",
                                "key": "0-0-3-3-2"
                            },
                            {
                                "title": "5 (数量 人/天)",
                                "key": "0-0-3-3-3"
                            },
                            {
                                "title": "5 (Flash)",
                                "key": "0-0-3-3-4"
                            },
                            {
                                "title": "10 (Unity 3D)",
                                "key": "0-0-3-3-5"
                            },
                            {
                                "title": "7 (C# WPF/WF)",
                                "key": "0-0-3-3-6"
                            },
                            {
                                "title": "5  (软件开发 人/天)",
                                "key": "0-0-3-3-7"
                            },
                            {
                                "title": "7.33 (result)",
                                "key": "0-0-3-3-8"
                            },
                            {
                                "title": "6.17  (两者平均)",
                                "key": "0-0-3-3-9"
                            }
                        ]
                    }
                ]
            },
            {
                "title": "日志/调测模块",
                "key": "0-0-4",
                "children": [
                    {
                        "title": "本地日志模块",
                        "key": "0-0-4-0",
                        "children": [
                            {
                                "title": "1 (参考范围)",
                                "key": "0-0-4-0-0"
                            },
                            {
                                "title": "项 (单位)",
                                "key": "0-0-4-0-1"
                            },
                            {
                                "title": "10 (综合后 人/天)",
                                "key": "0-0-4-0-2"
                            },
                            {
                                "title": "10 (数量 人/天)",
                                "key": "0-0-4-0-3"
                            },
                            {
                                "title": "5 (Flash)",
                                "key": "0-0-4-0-4"
                            },
                            {
                                "title": "7 (Unity 3D)",
                                "key": "0-0-4-0-5"
                            },
                            {
                                "title": "10 (C# WPF/WF)",
                                "key": "0-0-4-0-6"
                            },
                            {
                                "title": "10  (软件开发 人/天)",
                                "key": "0-0-4-0-7"
                            },
                            {
                                "title": "7.33 (result)",
                                "key": "0-0-4-0-8"
                            },
                            {
                                "title": "8.67  (两者平均)",
                                "key": "0-0-4-0-9"
                            }
                        ]
                    },
                    {
                        "title": "调试/工具模块",
                        "key": "0-0-4-1",
                        "children": [
                            {
                                "title": "1 (参考范围)",
                                "key": "0-0-4-1-0"
                            },
                            {
                                "title": "项 (单位)",
                                "key": "0-0-4-1-1"
                            },
                            {
                                "title": "10 (综合后 人/天)",
                                "key": "0-0-4-1-2"
                            },
                            {
                                "title": "10 (数量 人/天)",
                                "key": "0-0-4-1-3"
                            },
                            {
                                "title": "10 (Flash)",
                                "key": "0-0-4-1-4"
                            },
                            {
                                "title": "7 (Unity 3D)",
                                "key": "0-0-4-1-5"
                            },
                            {
                                "title": "10 (C# WPF/WF)",
                                "key": "0-0-4-1-6"
                            },
                            {
                                "title": "10  (软件开发 人/天)",
                                "key": "0-0-4-1-7"
                            },
                            {
                                "title": "9.0 (result)",
                                "key": "0-0-4-1-8"
                            },
                            {
                                "title": "9.50  (两者平均)",
                                "key": "0-0-4-1-9"
                            }
                        ]
                    },
                    {
                        "title": "性能/优化设计",
                        "key": "0-0-4-2", 
                        "children": [
                            {
                                "title": "1 (参考范围)",
                                "key": "0-0-4-2-0"
                            },
                            {
                                "title": "项 (单位)",
                                "key": "0-0-4-2-1"
                            },
                            {
                                "title": "20 (综合后 人/天)",
                                "key": "0-0-4-2-2"
                            },
                            {
                                "title": "20 (数量 人/天)",
                                "key": "0-0-4-2-3"
                            },
                            {
                                "title": "20 (Flash)",
                                "key": "0-0-4-2-4"
                            },
                            {
                                "title": "20 (Unity 3D)",
                                "key": "0-0-4-2-5"
                            },
                            {
                                "title": "20 (C# WPF/WF)",
                                "key": "0-0-4-2-6"
                            },
                            {
                                "title": "20  (软件开发 人/天)",
                                "key": "0-0-4-2-7"
                            },
                            {
                                "title": "20.00 (result)",
                                "key": "0-0-4-2-8"
                            },
                            {
                                "title": "20.00  (两者平均)",
                                "key": "0-0-4-2-9"
                            }
                        ]
                    },
                    {
                        "title": "兼容性测试",
                        "key": '0-0-4-3',
                        "children": [
                            {
                                "title": "1 (参考范围)",
                                "key": "0-0-4-3-0"
                            },
                            {
                                "title": "个 (单位)",
                                "key": "0-0-4-3-1"
                            },
                            {
                                "title": "8 (综合后 人/天)",
                                "key": "0-0-4-3-2"
                            },
                            {
                                "title": "5 (数量 人/天)",
                                "key": "0-0-4-3-3"
                            },
                            {
                                "title": "5 (Flash)",
                                "key": "0-0-4-3-4"
                            },
                            {
                                "title": "10 (Unity 3D)",
                                "key": "0-0-4-3-5"
                            },
                            {
                                "title": "10 (C# WPF/WF)",
                                "key": "0-0-4-3-6"
                            },
                            {
                                "title": "8  (软件开发 人/天)",
                                "key": "0-0-4-3-7"
                            },
                            {
                                "title": "8.33 (result)",
                                "key": "0-0-4-3-8"
                            },
                            {
                                "title": "8.17  (两者平均)",
                                "key": "0-0-4-3-9"
                            }
                        ]
                    }
                ]
            },
            {
                "title": "发布/部署",
                "key": "0-0-5",
                "children": [
                    {
                        "title": "版本发布",
                        "key": "0-0-5-0",
                        "children": [
                            {
                                "title": "1 (参考范围)",
                                "key": "0-0-5-0-0"
                            },
                            {
                                "title": "个 (单位)",
                                "key": "0-0-5-0-1"
                            },
                            {
                                "title": "6 (综合后 人/天)",
                                "key": "0-0-5-0-2"
                            },
                            {
                                "title": "5 (数量 人/天)",
                                "key": "0-0-5-0-3"
                            },
                            {
                                "title": "5 (Flash)",
                                "key": "0-0-5-0-4"
                            },
                            {
                                "title": "10 (Unity 3D)",
                                "key": "0-0-5-0-5"
                            },
                            {
                                "title": "10 (C# WPF/WF)",
                                "key": "0-0-5-0-6"
                            },
                            {
                                "title": "5  (软件开发 人/天)",
                                "key": "0-0-5-0-7"
                            },
                            {
                                "title": "8.33 (result)",
                                "key": "0-0-5-0-8"
                            },
                            {
                                "title": "6.67  (两者平均)",
                                "key": "0-0-5-0-9"
                            }
                        ]
                    },
                    {
                        "title": "版本部署",
                        "key": "0-0-5-1",
                        "children": [
                            {
                                "title": "1 (参考范围)",
                                "key": "0-0-5-1-0"
                            },
                            {
                                "title": "个 (单位)",
                                "key": "0-0-5-1-1"
                            },
                            {
                                "title": "6 (综合后 人/天)",
                                "key": "0-0-5-1-2"
                            },
                            {
                                "title": "5 (数量 人/天)",
                                "key": "0-0-5-1-3"
                            },
                            {
                                "title": "5 (Flash)",
                                "key": "0-0-5-1-4"
                            },
                            {
                                "title": "10 (Unity 3D)",
                                "key": "0-0-5-1-5"
                            },
                            {
                                "title": "10 (C# WPF/WF)",
                                "key": "0-0-5-1-6"
                            },
                            {
                                "title": "5  (软件开发 人/天)",
                                "key": "0-0-5-1-7"
                            },
                            {
                                "title": "8.33 (result)",
                                "key": "0-0-5-1-8"
                            },
                            {
                                "title": "6.67  (两者平均)",
                                "key": "0-0-5-1-9"
                            }
                        ]
                    }
                ]
            },
            {
                "title": "其他功能模块",
                "key": "0-0-6",
                "children": [
                    {
                        "title": "单片机程序开发",
                        "key": "0-0-6-0",
                        "children": [
                            {
                                "title": "1 (参考范围)",
                                "key": "0-0-6-0-0"
                            },
                            {
                                "title": "项 (单位)",
                                "key": "0-0-6-0-1"
                            },
                            {
                                "title": "N (综合后 人/天)",
                                "key": "0-0-6-0-2"
                            },
                            {
                                "title": "N (数量 人/天)",
                                "key": "0-0-6-0-3"
                            },
                            {
                                "title": "- (Flash)",
                                "key": "0-0-6-0-4"
                            },
                            {
                                "title": "- (Unity 3D)",
                                "key": "0-0-6-0-5"
                            },
                            {
                                "title": "- (C# WPF/WF)",
                                "key": "0-0-6-0-6"
                            },
                            {
                                "title": "-  (软件开发 人/天)",
                                "key": "0-0-6-0-7"
                            },
                            {
                                "title": "0.00 (result)",
                                "key": "0-0-6-0-8"
                            },
                            {
                                "title": "-  (两者平均)",
                                "key": "0-0-6-0-9"
                            }
                        ]
                    },
                    {
                        "title": "外部扩展模块",
                        "key": "0-0-6-1",
                        "children": [
                            {
                                "title": "1 (参考范围)",
                                "key": "0-0-6-1-0"
                            },
                            {
                                "title": "项 (单位)",
                                "key": "0-0-6-1-1"
                            },
                            {
                                "title": "25 (综合后 人/天)",
                                "key": "0-0-6-1-2"
                            },
                            {
                                "title": "20 (数量 人/天)",
                                "key": "0-0-6-1-3"
                            },
                            {
                                "title": "20 (Flash)",
                                "key": "0-0-6-1-4"
                            },
                            {
                                "title": "20 (Unity 3D)",
                                "key": "0-0-6-1-5"
                            },
                            {
                                "title": "20 (C# WPF/WF)",
                                "key": "0-0-6-1-6"
                            },
                            {
                                "title": "25  (软件开发 人/天)",
                                "key": "0-0-6-1-7"
                            },
                            {
                                "title": "20.00 (result)",
                                "key": "0-0-6-1-8"
                            },
                            {
                                "title": "22.50  (两者平均)",
                                "key": "0-0-6-1-9"
                            }
                        ]
                    },
                    {
                        "title": "其他模块",
                        "key": "0-0-6-2",
                        "children": [
                            {
                                "title": "1 (参考范围)",
                                "key": "0-0-6-2-0"
                            },
                            {
                                "title": "项 (单位)",
                                "key": "0-0-6-2-1"
                            },
                            {
                                "title": "N (综合后 人/天)",
                                "key": "0-0-6-2-2"
                            },
                            {
                                "title": "40 (数量 人/天)",
                                "key": "0-0-6-2-3"
                            },
                            {
                                "title": "40 (Flash)",
                                "key": "0-0-6-2-4"
                            },
                            {
                                "title": "35 (Unity 3D)",
                                "key": "0-0-6-2-5"
                            },
                            {
                                "title": "40 (C# WPF/WF)",
                                "key": "0-0-6-2-6"
                            },
                            {
                                "title": "50  (软件开发 人/天)",
                                "key": "0-0-6-2-7"
                            },
                            {
                                "title": "38.33 (result)",
                                "key": "0-0-6-2-8"
                            },
                            {
                                "title": "44.17  (两者平均)",
                                "key": "0-0-6-2-9"
                            }
                        ]
                    }
                ]
            }
        ]
    }];




class App extends Component{
    constructor(props) {
        super(props);
        this.state = {
            expandedKeys: ['0-0-0', '0-0-1'],
            autoExpandParent: true,
            checkedKeys: ['0-0-0'],
            selectedKeys: ['0-0-0'],
            datas: treeData
        }
    }
  
    //组件挂载
    componentDidMount() {

    }

    //组件卸载
    componentWillUnmount() {
        console.log("conponentWillUnmount")
    }

    //componentDidUpdate：更新后立即调用
    componentDidUpdate(prevProps) {
        // if (this.props.userID !== prevProps.userID) {
        //     this.fetchData(this.props.userID);
        // }
        console.log(prevProps, 'prevProps')
    }


    onExpand = (expandedKeys) => {
    //   console.log('onExpand', arguments);
      console.log(expandedKeys, 'expandedKeys')
      // if not set autoExpandParent to false, if children expanded, parent can not collapse.
      // or, you can remove all expanded children keys.
      this.setState({
        expandedKeys,
        autoExpandParent: false,
      });
    }

    onCheck = (checkedKeys) => {
        console.log('onCheck', checkedKeys);
        console.log(this.state.datas, 'datas')

        this.setState({ checkedKeys });

    }


    onSelect = (selectedKeys, info) => {
    //   console.log('onSelect', info);
      console.log(selectedKeys, 'selectedKeys')

      this.setState({ selectedKeys });
    }


    renderTreeNodes = (data) => {
      return data.map((item) => {
        if (item.children) {
          return (
            <TreeNode title={item.title} key={item.key} dataRef={item}>
              {this.renderTreeNodes(item.children)}
            </TreeNode>
          );
        }
        return <TreeNode {...item} />;
      });
    }
    
    render() {
      return (
        <div className="container">

            <Tree
                checkable
                onExpand={this.onExpand}
                expandedKeys={this.state.expandedKeys}
                autoExpandParent={this.state.autoExpandParent}
                onCheck={this.onCheck}
                checkedKeys={this.state.checkedKeys}
                onSelect={this.onSelect}
                selectedKeys={this.state.selectedKeys}
            >
            {this.renderTreeNodes(this.state.datas)}
            </Tree>
        </div>
      );
    }
}

ReactDom.render(
    <App />,
    document.getElementById('root')
)